# Используем официальный образ Node.js
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем package.json и package-lock.json
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все остальные файлы приложения
COPY . .

# Cloud Run ожидает, что приложение будет слушать на порту, указанном в переменной окружения PORT.
# По умолчанию, это 8080. Ваш код уже использует process.env.PORT || 8080, что отлично.
# Поэтому мы открываем этот порт.
EXPOSE 8080

# Команда для запуска вашего приложения
# Предполагается, что ваш основной файл называется index.js
CMD [ "node", "index.js" ]
